In [3]:
# SQLite is a software library that implements a self-contained, serverless, zero-configuration, 
#transactional SQL database engine


#  1----CREATE DATABASE USING SQLite 

#install and load SQLite3

import sqlite3

In [5]:
#connecting to sqlite

#step____1  CONNECTION OBJECT 
conn_object = sqlite3.connect("instructor.db")

In [6]:
#Cursor class is an instance using which you can invoke methods that execute 
#SQLite statements, fetch data from the result sets of the queries. You can 
#create Cursor object using the cursor() method of the Connection object/class.



#step_____2   CURSOR OBJECT 

cursor_object = conn_object.cursor()

In [7]:
#  2-----CREATE A TABLE IN THE DATABASE


#Before creating a table, let's first check if the table already exists or not. 
#To drop the table from a database, use the DROP query. A cursor is an object 
#that helps execute the query and fetch the records from the database.


# Drop the table if already exists.

cursor_object.execute("DROP TABLE IF EXISTS INSTRUCTOR")

In [16]:
# step_______3   creating table

table = "CREATE TABLE IF NOT EXISTS INSTRUCTOR (ID INT PRIMARY KEY NOT NULL, F_NAME  VARCHAR(20), L_NAME VARCHAR(20), CITY VARCHAR(20), CCODE VARCHAR(5));"
                                   
cursor_object.execute(table)
print("Table is Ready")

Table is Ready

In [25]:
#    3------INSERT DATA INTO TABLE 

cursor_object.execute("insert into INSTRUCTOR values (4, 'Raviya', 'Bilal', 'Toronto', 'CA'), (5, 'Rahul', 'Kumar', 'Mumbai', 'IN'), (6, 'Himaja', 'Velugula', 'Chicago', 'US')");

In [30]:
#   4------QUERY DATA IN THE TABLE 

cursor_object.execute("select * from INSTRUCTOR ;")
print(" Data from the table \n")
data = cursor_object.fetchall()
for row_data in data:
    print(row_data)

 Data from the table

(1, 'Rav', 'Ahuja', 'Toronto', 'CA')
(2, 'Rahul', 'Chowdary', 'Mumbai', 'IN')
(3, 'Hima', 'Velugu', 'Chicago', 'US')
(4, 'Raviya', 'Bilal', 'Toronto', 'CA')
(5, 'Rahul', 'Kumar', 'Mumbai', 'IN')
(6, 'Himaja', 'Velugula', 'Chicago', 'US')

In [32]:
# retrive only 3 rows from the table 

cursor_object.execute("select * from INSTRUCTOR ; ")
three_rows = cursor_object.fetchmany(3)
for rows in three_rows:
    print(rows)

(1, 'Rav', 'Ahuja', 'Toronto', 'CA')
(2, 'Rahul', 'Chowdary', 'Mumbai', 'IN')
(3, 'Hima', 'Velugu', 'Chicago', 'US')

In [37]:
#update the CITY and CCODE of Himaja to Philadelphia, EU

cursor_object.execute("update INSTRUCTOR set CITY = 'Philadelphia', CCODE = 'EU' where ID = 6;")

cursor_object.execute("select * from INSTRUCTOR ;")
updated_table = cursor_object.fetchall()
for update in updated_table:
    print(update)

(1, 'Rav', 'Ahuja', 'Toronto', 'CA')
(2, 'Rahul', 'Chowdary', 'Mumbai', 'IN')
(3, 'Hima', 'Velugu', 'Chicago', 'US')
(4, 'Raviya', 'Bilal', 'Toronto', 'CA')
(5, 'Rahul', 'Kumar', 'Mumbai', 'IN')
(6, 'Himaja', 'Velugula', 'Philadelphia', 'EU')

In [44]:
#  5-----RETRIVE DATA INTO PANDAS 
!pip install pandas 
import pandas as pd

df = pd.read_sql_query("select * from INSTRUCTOR ;", conn_object)
df

Requirement already satisfied: pandas in /opt/conda/lib/python3.12/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in /opt/conda/lib/python3.12/site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/conda/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.12/site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in /opt/conda/lib/python3.12/site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

   ID  F_NAME    L_NAME          CITY CCODE
0   1     Rav     Ahuja       Toronto    CA
1   2   Rahul  Chowdary        Mumbai    IN
2   3    Hima    Velugu       Chicago    US
3   4  Raviya     Bilal       Toronto    CA
4   5   Rahul     Kumar        Mumbai    IN
5   6  Himaja  Velugula  Philadelphia    EU

In [46]:
df.L_NAME

0       Ahuja
1    Chowdary
2      Velugu
3       Bilal
4       Kumar
5    Velugula
Name: L_NAME, dtype: object

In [ ]:
# step_______4 close the connection 

conn_object.close()